{{{header(kyrpt,Richard Westhaver,ellis@rwest.io)}}}
* help
#+begin_src shell :results pp replace
krypt -h
#+end_src

#+RESULTS:
#+begin_example
Krypt CLI

Usage: krypt [OPTIONS] [COMMAND]

Commands:
  check   check service providers and config
  show    Show Krypt info
  search  Query the Krypt
  help    Print this message or the help of the given subcommand(s)

Options:
  -c, --cfg <CFG>    Set the default config file [env: KRYPT_CONFIG_FILE=]
  -u, --user <USER>  Set a user for this command [env: USER=ellis]
  -l, --level...     Set log level
  -h, --help         Print help
  -V, --version      Print version
#+end_example
